app/Controllers/LoginUserController.php

SELECT *
FROM `users`
WHERE `email` = 'ya@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $userModel = new UserModel();
        $user = $userModel
            ->select('users.*, comptes.role_id') // Récupère les colonnes nécessaires
            ->join('comptes', 'comptes.user_id = users.id') // Jointure entre `users` et `comptes`
            ->where('users.email', $this->request->getPost('email'))
            ->first();

        // Vérifie les informations d'identification
        if (!$user || !password_verify($this->request->getPost('password'), $user['password'])) {
            return redirect()->back()->with('error', 'Email ou mot de passe incorrect.');